In [2]:
import pandas as pd

# Series

In [3]:
data = [1,2,3,4,5]

In [4]:
s = pd.Series(data)

In [5]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
index = ['Linha' + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [7]:
s = pd.Series(data, index)

In [8]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [9]:
data = {'Linha' + str(i): i + 1 for i in range(5)}

In [10]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [11]:
s = pd.Series(data)

In [12]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [13]:
s1 = s + 2

In [14]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [15]:
s2 = s + s1

In [16]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# Dataframes

In [17]:
data = [[1,2,3],[4,5,6],[7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [18]:
df1 = pd.DataFrame(data)

In [19]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [20]:
index = ['Linha' + str(i) for i in range(3)]

In [21]:
index

['Linha0', 'Linha1', 'Linha2']

In [22]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [23]:
columns = ['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [24]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [25]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [26]:
df3 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df4 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df3, df4])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [27]:
dados = [('A', 'B'), ('C', 'D')]
df5 = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df5

   L1 L2
C1  A  B
C2  C  D

In [28]:
dados1 = [[1, 2, 3], [4, 5, 6]]
index1 = 'X,Y'.split(',')
columns1 = list('CBA')[::-1]
df6 = pd.DataFrame(dados1, index1, columns1)
df6

   A  B  C
X  1  2  3
Y  4  5  6

In [30]:
dados2 = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df7 = pd.DataFrame(dados2)
df7

   A  B
X  1  2
Y  3  4